NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lc10a_flpr_peripherals.h
/*VPR peripheral registers*/
#define VPR_PRESENT 1
#define VPR_COUNT 1

#define VPR00_RISCV_EXTN_E 1                         /*!< Supports RV32E (Base Integer Instruction Set embedded)               */
#define VPR00_RISCV_EXTN_M 1                         /*!< Supports M extension (Integer Multiplication and Division)           */
#define VPR00_RISCV_EXTN_C 1                         /*!< Supports C extension (compressed instructions)                       */
#define VPR00_RISCV_EXTN_ZBA 1                       /*!< Supports Zba extension (Bit Manipulation - Address generation
                                                          instructions)*/
#define VPR00_RISCV_EXTN_ZBB 1                       /*!< Supports Zbb extension (Bit Manipulation - Basic bit manipulation)   */
#define VPR00_RISCV_EXTN_ZBC 1                       /*!< Supports Zbc extension (Bit Manipulation - Carry-less multiplication)*/
#define VPR00_RISCV_EXTN_ZBS 1                       /*!< Supports Zbs extension (Bit Manipulation - Single bit instructions)  */
#define VPR00_RISCV_EXTN_ZCB 1                       /*!< Supports Zcb extension (code-size saving instructions)               */
#define VPR00_RISCV_EXTN_ZIFENCEI 0                  /*!< Does not support FENCE.I instruction (use FENCE instruction instead) */
#define VPR00_RISCV_EXTN_ZICSR 1                     /*!< Supports CSR (Control and Status Register) instructions              */
#define VPR00_RISCV_EXTN_ZICNTR 0                    /*!< Does not support CNTR (base counter) instructions                    */
#define VPR00_RISCV_EXTN_SMCLIC 1                    /*!< Supports M-mode CLIC (interrupt controller)                          */
#define VPR00_RISCV_EXTN_SMCLICCONFIG 1              /*!< Supports MCLICCFG register                                           */
#define VPR00_RISCV_EXTN_SDEXT 1                     /*!< Supports external debugger                                           */
#define VPR00_RISCV_EXTN_SDTRIG 1                    /*!< Debugger supports triggers (breakpoints)                             */
#define VPR00_INIT_PC_RESET_VALUE 0x00000000         /*!< Boot vector (INIT_PC_RESET_VALUE): 0x00000000                        */
#define VPR00_VPR_START_RESET_VALUE 0                /*!< Self-booting (VPR_START_RESET_VALUE): 0                              */
#define VPR00_RAM_BASE_ADDR 0x20000000               /*!< VPR RAM base address (RAM_BASE_ADDR): 0x20000000                     */
#define VPR00_RAM_SZ 20                              /*!< VPR RAM size (RAM_SZ): 20 (Value in bytes is computed as 2^(RAM
                                                          size))*/
#define VPR00_VPRSAVEDCTX_REGNAME NRF_MEMCONF->POWER[1].RET /*!< (unspecified)                                                 */
#define VPR00_VPRSAVEDCTX_REGBIT 0                   /*!< (unspecified)                                                        */
#define VPR00_RETAINED 0                             /*!< Retain registers in Deep Sleep mode: 0                               */
#define VPR00_VPRSAVEDCTX 1                          /*!< Restore VPR context at VPR reset using register
                                                          [NRF_MEMCONF->POWER1.RET].MEM[0]*/
#define VPR00_VPRSAVEADDR 0x2002FD40                 /*!< VPR context save address: 0x2002FD40                                 */
#define VPR00_VPRSAVESIZE 512                        /*!< VPR context save size: 512 bytes                                     */
#define VPR00_VPRREMAPADDRVTOB 0x00000000            /*!< VPR remap address: 0x00000000                                        */
#define VPR00_VEVIF_NTASKS_MIN 16                    /*!< VEVIF tasks: 16..22                                                  */
#define VPR00_VEVIF_NTASKS_MAX 22                    /*!< VEVIF tasks: 16..22                                                  */
#define VPR00_VEVIF_NTASKS_SIZE 23                   /*!< VEVIF tasks: 16..22                                                  */
#define VPR00_VEVIF_TASKS_MASK 0x007F0000            /*!< Mask of supported VEVIF tasks: 0x007F0000                            */
#define VPR00_VEVIF_NDPPI_MIN 16                     /*!< VEVIF DPPI indices: 16..19                                           */
#define VPR00_VEVIF_NDPPI_MAX 19                     /*!< VEVIF DPPI indices: 16..19                                           */
#define VPR00_VEVIF_NDPPI_SIZE 20                    /*!< VEVIF DPPI indices: 16..19                                           */
#define VPR00_VEVIF_DPPI_MASK 0x000F0000             /*!< Mask of supported VEVIF DPPI channels: 0x000F0000                    */
#define VPR00_VEVIF_NEVENTS_MIN 16                   /*!< VEVIF events: 16..22                                                 */
#define VPR00_VEVIF_NEVENTS_MAX 22                   /*!< VEVIF events: 16..22                                                 */
#define VPR00_VEVIF_NEVENTS_SIZE 23                  /*!< VEVIF events: 16..22                                                 */
#define VPR00_VEVIF_EVENTS_MASK 0x00100000           /*!< Mask of supported VEVIF events: 0x00100000                           */
#define VPR00_DEBUGGER_OFFSET 1024                   /*!< Debugger interface register offset: 0x5004C400                       */
#define VPR00_RTP_VPR_1_5 1                          /*!< New RTP features                                                     */
#define VPR00_VPR_BITIS_1_6 0                        /*!< (unspecified)                                                        */

/*Voltage glitch detectors*/
#define GLITCHDET_PRESENT 1
#define GLITCHDET_COUNT 1

/*RRAM controller GLITCH detector*/
#define RRAMC_PRESENT 1
#define RRAMC_COUNT 1

#define RRAMC_NAPMODE 1                              /*!< (unspecified)                                                        */
#define RRAMC_NRRAMDATAUNITSIZE 128                  /*!< RRAM data unit size : 128 bits per data unit                         */
#define RRAMC_NWRITEBUFSIZE 16                       /*!< Maximum write buffer size : 16                                       */
#define RRAMC_LOWPOWERCONFIGOPTION2 0                /*!< (unspecified)                                                        */
#define RRAMC_REGION0ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION0SIZE 4                          /*!< (unspecified)                                                        */
#define RRAMC_REGION0SIZE_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION0READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION0READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION0EXECUTE 0                       /*!< (unspecified)                                                        */
#define RRAMC_REGION0EXECUTE_WRITABLE 0              /*!< (unspecified)                                                        */
#define RRAMC_REGION0SECURE 0                        /*!< (unspecified)                                                        */
#define RRAMC_REGION0SECURE_WRITABLE 0               /*!< (unspecified)                                                        */
#define RRAMC_REGION0OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION0OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITEONCE 1                     /*!< (unspecified)                                                        */
#define RRAMC_REGION0WRITEONCE_WRITABLE 0            /*!< (unspecified)                                                        */
#define RRAMC_REGION0LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION0LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1SIZE 4                          /*!< (unspecified)                                                        */
#define RRAMC_REGION1SIZE_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION1READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION1EXECUTE 0                       /*!< (unspecified)                                                        */
#define RRAMC_REGION1EXECUTE_WRITABLE 0              /*!< (unspecified)                                                        */
#define RRAMC_REGION1SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION1SECURE_WRITABLE 1               /*!< (unspecified)                                                        */
#define RRAMC_REGION1OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION1OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITEONCE 1                     /*!< (unspecified)                                                        */
#define RRAMC_REGION1WRITEONCE_WRITABLE 0            /*!< (unspecified)                                                        */
#define RRAMC_REGION1LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION1LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2SIZE 8                          /*!< (unspecified)                                                        */
#define RRAMC_REGION2SIZE_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION2READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION2EXECUTE 0                       /*!< (unspecified)                                                        */
#define RRAMC_REGION2EXECUTE_WRITABLE 0              /*!< (unspecified)                                                        */
#define RRAMC_REGION2SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION2SECURE_WRITABLE 0               /*!< (unspecified)                                                        */
#define RRAMC_REGION2OWNER 2                         /*!< (unspecified)                                                        */
#define RRAMC_REGION2OWNER_WRITABLE 0                /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITEONCE 0                     /*!< (unspecified)                                                        */
#define RRAMC_REGION2WRITEONCE_WRITABLE 1            /*!< (unspecified)                                                        */
#define RRAMC_REGION2LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION2LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3ADDR_WRITABLE 0                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3SIZE 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION3SIZE_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION3READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION3EXECUTE 1                       /*!< (unspecified)                                                        */
#define RRAMC_REGION3EXECUTE_WRITABLE 1              /*!< (unspecified)                                                        */
#define RRAMC_REGION3SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION3SECURE_WRITABLE 1               /*!< (unspecified)                                                        */
#define RRAMC_REGION3OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION3OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITEONCE 0                     /*!< (unspecified)                                                        */
#define RRAMC_REGION3WRITEONCE_WRITABLE 1            /*!< (unspecified)                                                        */
#define RRAMC_REGION3LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION3LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4ADDR_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4SIZE 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION4SIZE_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4READ 1                          /*!< (unspecified)                                                        */
#define RRAMC_REGION4READ_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITE 1                         /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITE_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION4EXECUTE 1                       /*!< (unspecified)                                                        */
#define RRAMC_REGION4EXECUTE_WRITABLE 1              /*!< (unspecified)                                                        */
#define RRAMC_REGION4SECURE 1                        /*!< (unspecified)                                                        */
#define RRAMC_REGION4SECURE_WRITABLE 1               /*!< (unspecified)                                                        */
#define RRAMC_REGION4OWNER 0                         /*!< (unspecified)                                                        */
#define RRAMC_REGION4OWNER_WRITABLE 1                /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITEONCE 0                     /*!< (unspecified)                                                        */
#define RRAMC_REGION4WRITEONCE_WRITABLE 1            /*!< (unspecified)                                                        */
#define RRAMC_REGION4LOCK 0                          /*!< (unspecified)                                                        */
#define RRAMC_REGION4LOCK_WRITABLE 1                 /*!< (unspecified)                                                        */
#define RRAMC_GLITCHDETECTORS 0                      /*!< (unspecified)                                                        */

/*Control access port*/
#define CTRLAPPERI_PRESENT 1
#define CTRLAPPERI_COUNT 1

